
# #문제4
# 1부터 n까지 숫자가 적힌 카드 뭉치를 다음 규칙에 따라 카드 뭉치를 섞었을 때,
# 아래에서부터 k번째에 있는 카드에 적힌 숫자를 알아내려합니다.
# 카드 뭉치 가장 아래에는 1이 쓰여있으며, 위로 갈수록 숫자가 커집니다.
# 카드 뭉치를 섞는 규칙은 다음과 같습니다.
#
# ```
# 1. 카드 뭉치를 정확히 반으로 나눕니다.
# 2. 두 개로 나뉜 카드 뭉치를 교차로 섞어서 카드 뭉치 하나를 만듭니다.
# 이때, 항상 1이 적힌 카드가 있는 뭉치를 아래로 놓고 섞습니다.
# 3. 위 과정을 반복합니다.
# ```
#
# 예를 들어, 1부터 6까지 숫자가 적힌 카드 뭉치를 3번 섞는다면 과정별로 아래에서부터 적힌 숫자는 다음과 같습니다.
#
# | 횟수 | 카드 뭉치          |
# |------|--------------------|
# | 1    | [1, 4, 2, 5, 3, 6] |
# | 2    | [1, 5, 4, 3, 2, 6] |
# | 3    | [1, 3, 5, 2, 4, 6] |
#
# 이때, 아래에서 3번째에 있는 카드에 적힌 숫자는 5입니다.
#
# 처음에 가장 위에 있는 카드에 적힌 숫자 n, 섞는 횟수 mix, 알고 싶은 카드의 위치 k가 매개변수로 주어질 때,
# 아래에서부터 k번째에 있는 카드에 적힌 숫자를 return 하도록 solution 함수를 작성했습니다.
# 그러나, 코드 일부분이 잘못되어있기 때문에, 몇몇 입력에 대해서는 올바르게 동작하지 않습니다
# . 주어진 코드에서 _**한 줄**_만 변경해서 모든 입력에 대해 올바르게 동작하도록 수정하세요.
#
# ---
# #####매개변수 설명
# 처음에 가장 위에 있는 카드에 적힌 숫자 n, 섞는 횟수 mix, 알고 싶은 카드의 위치 k가 solution 함수의 매개변수로 주어집니다.
# * n은 10 이상 50 이하인 짝수입니다.
# * 카드는 0회 이상 10회 이하로 섞습니다.
# * k는 1 이상 n 이하인 자연수입니다.
#
# ---
# #####return 값 설명
# 아래에서 k번째에 있는 카드에 적힌 숫자를 return 해주세요.

def solution(n, mix, k):
    answer = 0
    card = [_ for _ in range(1, n+1)]
    while mix != 0:
        mix = mix - 1
        card_a, card_b = [0 for _ in range(n//2)], [0 for _ in range(n//2)] #반으로 나눈 카드 뭉치
        for i in range(0, n): #카드 뭉치
            if i < n//2:  # 카드 뭉치 왼쪽
                card_a[i] = card[i]
            else:  # 카드 뭉치 오른쪽
                # card_b[i] = card[i]
                card_b[i - (n // 2)] = card[i] # 0,1,2,0,1,2,...
        for i in range(0, n):  #재조합
            if i % 2 == 0: # 짝수 일때
                card[i] = card_a[i//2]   #0,2,4,6 ..
            else:
                card[i] = card_b[i//2]
    answer = card[k-1]
    return answer

#아래는 테스트케이스 출력을 해보기 위한 코드입니다. 아래에는 잘못된 부분이 없으니 위의 코드만 수정하세요.
n = 6
mix = 3
k = 3
ret = solution(n, mix, k)

#[실행] 버튼을 누르면 출력 값을 볼 수 있습니다.
print("solution 함수의 반환 값은", ret, "입니다.")